laRhea BL
                          laRhea BL
Speed Mix                 laRhea V+
                          veuillez placer
une tasse           Démarrage
patienter S.V.P.          Préselection
-   SUCRE    +         veuillez placer
une tasse           Boisson servie
enlever tasse        Préparation
boisson num. §1         §1
préparation                      Introduisez
le montant exact        contrôler
groupe café               Programmation
OK                    Erreur durant
la programmation      1= CLÉ ---> VMC
2= VMC ---> CLÉ     PROGRAMMATION
données EPROM         PROGRAMMATION
RHEA FLASH            remplir produit
§1                  FILTRE EAU
LAVAGE  10=Avant         Machine
en fonction                 SERVICE
CARTE                       Pas disponible
                     réinitialiser
marcs café=RESET      réinitialiser
marcs café=P1          
                                  Credit:
§1                          Hors Service
Filtre à eau           Hors Service
nettoyer groupe        prix  :    §1
                      Hors Service
gâteaux de café        Pas de produit
                     Remplissage eau
Attendre SVP        Attendre SVP
                       Attendre
température                Hors Service
OFF §1 §2              machine off
§1:§2                   Redémarrage
à:  §1:§2               Test vente
                         prener un moment
de détente         Lait
Frais                          Message  3
programmable             Moment de
pause                     Toujours
à votre service            insérer monnaie
_                   t. Soluble   §1
----------------    t.r §1  t.v §2
t.c §3               Lecteur de carte
non connecté       Audit données
                      P I C H E T
                        rheavendors
                        veuillez placer
une tasse           Pas Boisson Lait
Frais    OFF §1    HAPPY
HOUR                          LIBRE SERVICE
§1                    Café grain vide
OFF §1              mes 48
                             HORS SERVICE
pas d'eau              charger eau et
appuyer bouton 1     Nettoyage vapeur
automatique        Rincer vapeur
steam rinsing         SERVICE
                            Erreur sur clé
code  §1             1-4=Mix 5=MilkMd
7=Gr 8=BC 9=Desc   1-4=Rinçage
7=Gr 8=BC 9=Desc        1-4=Rinse 5=Milk
7=grinder 8=BC     1-4=Rinçage
8=BC                    1-4=Rinçage
                        Rinçage   §1
§2                     Lecteur RFID
connecté               Bonjour    §1
§2-§3-§4 §5 §6:§7     veuillez insérer
le montant exact   Changer
filtre à Eau                Nettoyer le
groupe café             Vider le bac a
marc de café         RÉGLAGE PRODUIT
---- OK ----        INSTALLATION
                       Fin
d'installation                  crédit = 0
                         placer la
carte                     Sélection carte
                    réserve produit
REMPLIR LE CAFÉ     Pas disponible
§1                   -  S U C R E   +
                   choisissez Votre
boisson            Module Porte
vers. §1               Module Espresso
vers. §1            Module Lait
vers. §1                Periodic rinse
in §1 seconds         
OFF §1  §2                        Veuillez enlever
la tasse           Remplissage
Chaudière vapeur        Code carte
client invalide          Code carte
machine invalide         lucky
sélection                     JETON
                              patienter S.V.P.
température vap.   Prix  :    §1
Crédit: §2            First coffee
in progress            vider le bac a
marc de café         Enlever
récolte goutte              Insérer
récolte goutte              Lavage  vapeur
10=Avant             mettre detergent
10=Avant           filling water...
conduc.=§1 uS      mettre eau
10=Avant                 rinçage à l'eau
chaude  10=Avant    Module Lait
Démarrage...            Réservoir lait
vide                 S T O P
                            Carte RFID
bloquée                  Veuillez rincer
le module lait      Rincer avec
déterg. 10=Avant        Cyclic Test
round #§1               Cyclic Test
Stopped!!!              Rincer avec eau
froide 10=Avant     END Cleaning
with Detergent         Fin du rinçage
vapeur               patienter S.V.P.
nett. Unité lait   Veuillez placer
une tasse           Réglage moulin
patienter S.V.P.     §1
HOT WATER                        quelques
selections rest.            
                                  Mettre du café
App.touche PROG       
reset automatiq.                  Fin
désinstallation                 Final Result:§1
KEY PRESS <PROG>    Temps nettoyage
M.L. mis à jour     TEST EN COURS
                      Confirm. reset
partiel Touc.P10     Starting Test
4=start PROG=end      TEST MOTOR - §1
sx §2  dx §3        TEST - §1  Tp: §2
up §3  dn §4      Final Result
TEST - §1              System halted
Please restart!       Empty the waste
liquid tank         Insert the waste
liquid tank        rinsing §1   §2
........uS=§3       Have you done
checks?>START/10      Clean.Deter.type
10=Tab 12=Liquid   check milk
                         Check Detergent
of the water mix    Milk Mod.Clean.:
check deter. §1    Cleaning §1  §2
........uS=§3       Dissolving
Detergent §1 §2          Insert the milk
tube.10:now 9:no    Ins. Tube/refill
Milk 10:now 9:no   check milk
presence                 check milk
quality                  check milk and
make cleaning        Gest. rhMM1.v+ ?
B1=Enable B2=no    Clean. rhMM1.v+
Time §1:§2 Ok=P1    Milk Mod.Clean.:
low deterg. §1     check tank cold
milk temperature    Available
                          Close  Coffee
KEY PRESS <PROG>      Open   Coffee
KEY PRESS <PROG>      1/13 Clean Grin.
1=Grin1; 2=Grin2   2/13 G§1 Close
shutter.  10=ok      3/13 Rem. brewer
& bean hop 10=ok   4/13 Inst. clean
device.    10=ok   5/13 Grinder
clean   10=start       Cycle §1 of §2
                     6/13 Rep. Clean
10=Yes; other=NO    7/13 Ref. Clean
device.    10=ok    8/13 Put back
bean hop.  10=ok      9/13 Open hopp.
shutter.  10=ok     10/13 Coffee
grind.  10=Start       Cycle §1 of §2
timeout §3 sec       11/13 Rep. Proc.
10=Yes; other=NO   12/13 Put back
Brewer.  10 = ok     13/13 Coffee?
10=Yes; other=NO      ESPRESSO
preparing                  Forthcoming
sched maintenan.        Maintenance must
be performed       Enter Weight
1 = Save  §1           Boisson pręte
enlever tasse         HORS SERVICE
Manque d'eau           Place your cup
and close flap       Enlever le bac
des eaux usées       Mettre le bac
des eaux usées        Please close the
flap               Veuillez rincer
le module lait      veuillez placer
une tasse           Introduisez
le montant exact        contrôler
groupe café               Hors Service
nettoyer groupe        Redémarrage
à:  §1:§2               Test vente
                         prener un moment
de détente         Lait
Frais                          Message  3
programmable             Moment de
pause                     Toujours
à votre service            insérer monnaie
                    Nettoyer le
groupe café             Vider le bac a
marc de café         Fin Programmat.
Attendez SVP....    Code d'Accès
Non Habilité           Désinstallation
En Cours........     
                                  Calibrage
impossible                Enlever Groupe
app. touche PROG     Replacer Groupe
app. touche PROG    Ouvrir chaudière
vanne.  10=start   appuyer sur la
touche  >PROG<       Fin d'instal.
Fermer vanne          Eau OK?
10=Avant                    Bac  de liquides
inséré? 10=start   Bac  eaux usées
inséré? 10=start    Vider bac marcs
de café 10=Avant    Bac Eau Usee
Vide?   10=Avant       ENREGISTREMENT
hors service         Historique des
hors service         PROGRAMMATION
----------------      Préselection
Inutilisé              Produit  §1
0=inhib.   §2.§3        Temps Moulin §1
café        §2.§3   emps Moulin
café        §1.§2       Saisir Grammes
1=Enregist. §1       Ent. ML of water
1=Save 2=rep §1    Empties test jug
Test:  1=ok 2=no   Fill H2O FM tank
t.tube 1=ok 2=no   Confirm Action
10=YES      9=NO     1-4=Mix 5=MilkMd
8=BC 9=Desc        1-4=Rinçage
8=BC 9=Desc             1-4=Rinse 5=Milk
8=BC               1-4=Rinçage
7=grinder 8=BC          1-4=Mx M:5=C 6=D
7=Gr 8=BC 9=Desc   1-4=Mix 5=MilkMd
6=DeM 8=BC 9=Des   1-4=Rinç. 5=Milk
6=D.M 7=Gr. 8=BC   1-4=Rinç. 5=Milk
6=Desc.Milk 8=BC   BASSE CONSO
                        Credit:
Carte de crédit             Présenter une
carte de crédit       Calib. broyeur
nécessaire           Refill   cups
                      Use own cups
                       